import string 
txt = input("Enter a sentence: ")
cleaned_sentence = txt.translate(str.maketrans("", "", string.punctuation)) 
words = cleaned_sentence.split()
longest_word = max(words, key=len)
print(f"longest word is: '{longest_word}'")
print(f"its length is: {len(longest_word)} characters.")
# პირველი ხაზი იმპორტირებს string მოდულს, რომელიც შეიცავს სხვადასხვა სტრინგის ოპერაციებს და კონსტანტებს.
# მეორე ხაზი იღებს მომხმარებლისგან წინადადებას.
# მესამე ხაზი იყენებს translate() მეთოდს და str.maketrans() ფუნქციას წინადადებისგან ყველა პუნქტუაციის სიმბოლოს მოსაშორებლად. ეს უზრუნველყოფს, რომ პუნქტუაცია არ იქნეს გათვალისწინებული სიტყვების სიგრძის შედარებისას.
# მეოთხე ხაზი იყენებს split() მეთოდს წინადადების სიტყვებად დაყოფისთვის.
# მეხუთე ხაზი იყენებს max() ფუნქციას longest_word ცვლადში ყველაზე გრძელი სიტყვის შესანახად. key=len არგუმენტი max() ფუნქციას ეუბნება, რომ სიტყვების სიგრძე უნდა გამოიყენოს შედარებისთვის.
# მეექვსე და მეშვიდე ხაზები დაბეჭდავს longest_word ცვლადში შენახულ ყველაზე გრძელ სიტყვას და მისი სიგრძეს შესაბამის შეტყობინებებთან ერთად. 
